homework/c2/sysbench/oltp_read_only.32threads.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 32
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 32 tps: 393.89 qps: 6327.59 (r/w/o: 5536.60/0.00/790.99) lat (ms,95%): 102.97 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 32 tps: 398.81 qps: 6378.92 (r/w/o: 5581.49/0.00/797.43) lat (ms,95%): 102.97 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 32 tps: 398.10 qps: 6367.29 (r/w/o: 5570.89/0.00/796.40) lat (ms,95%): 101.13 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 32 tps: 398.00 qps: 6367.41 (r/w/o: 5571.61/0.00/795.80) lat (ms,95%): 102.97 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 32 tps: 396.30 qps: 6343.90 (r/w/o: 5551.30/0.00/792.60) lat (ms,95%): 102.97 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 32 tps: 397.19 qps: 6358.68 (r/w/o: 5564.20/0.00/794.47) lat (ms,95%): 102.97 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            333984
        write:                           0
        other:                           47712
        total:                           381696
    transactions:                        23856  (397.22 per sec.)
    queries:                             381696 (6355.47 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0561s
    total number of events:              23856

Latency (ms):
         min:                                   43.30
         avg:                                   80.52
         max:                                  159.83
         95th percentile:                      102.97
         sum:                              1920881.95

Threads fairness:
    events (avg/stddev):           745.5000/27.49
    execution time (avg/stddev):   60.0276/0.02