homework/c2/sysbench/oltp_read_only.64threads.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 64
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 64 tps: 424.57 qps: 6842.09 (r/w/o: 5986.96/0.00/855.14) lat (ms,95%): 186.54 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 64 tps: 426.52 qps: 6815.77 (r/w/o: 5962.54/0.00/853.23) lat (ms,95%): 186.54 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 64 tps: 434.38 qps: 6947.06 (r/w/o: 6079.11/0.00/867.96) lat (ms,95%): 186.54 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 64 tps: 432.11 qps: 6923.43 (r/w/o: 6058.21/0.00/865.22) lat (ms,95%): 183.21 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 64 tps: 429.80 qps: 6881.46 (r/w/o: 6022.56/0.00/858.91) lat (ms,95%): 183.21 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 64 tps: 429.60 qps: 6867.69 (r/w/o: 6008.19/0.00/859.50) lat (ms,95%): 186.54 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            361690
        write:                           0
        other:                           51670
        total:                           413360
    transactions:                        25835  (429.68 per sec.)
    queries:                             413360 (6874.83 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.1248s
    total number of events:              25835

Latency (ms):
         min:                                   73.75
         avg:                                  148.82
         max:                                  268.87
         95th percentile:                      186.54
         sum:                              3844785.97

Threads fairness:
    events (avg/stddev):           403.6719/7.64
    execution time (avg/stddev):   60.0748/0.03