homework/c2/sysbench/oltp_read_only.8threads.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 8
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 8 tps: 273.23 qps: 4380.51 (r/w/o: 3833.25/0.00/547.26) lat (ms,95%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 267.61 qps: 4281.05 (r/w/o: 3745.83/0.00/535.22) lat (ms,95%): 39.65 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 274.10 qps: 4381.98 (r/w/o: 3833.98/0.00/548.00) lat (ms,95%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 273.80 qps: 4383.02 (r/w/o: 3835.42/0.00/547.60) lat (ms,95%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 273.20 qps: 4371.08 (r/w/o: 3824.48/0.00/546.60) lat (ms,95%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 272.50 qps: 4360.41 (r/w/o: 3815.41/0.00/545.00) lat (ms,95%): 38.25 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            228942
        write:                           0
        other:                           32706
        total:                           261648
    transactions:                        16353  (272.43 per sec.)
    queries:                             261648 (4358.92 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0242s
    total number of events:              16353

Latency (ms):
         min:                                   21.63
         avg:                                   29.36
         max:                                   97.83
         95th percentile:                       38.25
         sum:                               480068.47

Threads fairness:
    events (avg/stddev):           2044.1250/167.92
    execution time (avg/stddev):   60.0086/0.01