homework/c2/sysbench/oltp_update_index.16threads.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 16
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 16 tps: 596.44 qps: 596.44 (r/w/o: 0.00/594.14/2.30) lat (ms,95%): 35.59 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 16 tps: 617.73 qps: 617.73 (r/w/o: 0.00/613.63/4.10) lat (ms,95%): 34.95 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 16 tps: 632.70 qps: 632.70 (r/w/o: 0.00/629.70/3.00) lat (ms,95%): 34.95 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 16 tps: 627.40 qps: 627.40 (r/w/o: 0.00/625.20/2.20) lat (ms,95%): 34.95 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 16 tps: 622.50 qps: 622.50 (r/w/o: 0.00/620.00/2.50) lat (ms,95%): 34.95 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 16 tps: 600.16 qps: 600.16 (r/w/o: 0.00/597.06/3.10) lat (ms,95%): 35.59 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           36813
        other:                           172
        total:                           36985
    transactions:                        36985  (615.90 per sec.)
    queries:                             36985  (615.90 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0488s
    total number of events:              36985

Latency (ms):
         min:                                    1.15
         avg:                                   25.96
         max:                                  196.37
         95th percentile:                       34.95
         sum:                               960160.85

Threads fairness:
    events (avg/stddev):           2311.5625/15.07
    execution time (avg/stddev):   60.0101/0.01