homework/c2/sysbench/oltp_update_index.64threads.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 64
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 64 tps: 121.46 qps: 121.46 (r/w/o: 0.00/120.86/0.60) lat (ms,95%): 1089.30 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 64 tps: 31.10 qps: 31.10 (r/w/o: 0.00/30.90/0.20) lat (ms,95%): 3574.99 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 64 tps: 68.40 qps: 68.40 (r/w/o: 0.00/68.30/0.10) lat (ms,95%): 1648.20 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 64 tps: 38.40 qps: 38.40 (r/w/o: 0.00/38.30/0.10) lat (ms,95%): 2985.89 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 64 tps: 46.50 qps: 46.50 (r/w/o: 0.00/46.30/0.20) lat (ms,95%): 2279.14 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 64 tps: 65.20 qps: 65.20 (r/w/o: 0.00/65.00/0.20) lat (ms,95%): 1903.57 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           3761
        other:                           14
        total:                           3775
    transactions:                        3775   (61.64 per sec.)
    queries:                             3775   (61.64 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          61.2372s
    total number of events:              3775

Latency (ms):
         min:                                    1.93
         avg:                                 1026.96
         max:                                 6319.18
         95th percentile:                     2493.86
         sum:                              3876792.30

Threads fairness:
    events (avg/stddev):           58.9844/1.85
    execution time (avg/stddev):   60.5749/0.24