homework/c2/sysbench/oltp_update_index.8threads.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 8
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 8 tps: 315.02 qps: 315.02 (r/w/o: 0.00/313.52/1.50) lat (ms,95%): 34.33 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 329.91 qps: 329.91 (r/w/o: 0.00/328.81/1.10) lat (ms,95%): 31.94 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 324.31 qps: 324.31 (r/w/o: 0.00/322.91/1.40) lat (ms,95%): 31.94 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 329.30 qps: 329.30 (r/w/o: 0.00/327.90/1.40) lat (ms,95%): 31.94 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 365.00 qps: 365.00 (r/w/o: 0.00/362.90/2.10) lat (ms,95%): 30.81 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 348.10 qps: 348.10 (r/w/o: 0.00/346.00/2.10) lat (ms,95%): 30.81 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           20029
        other:                           96
        total:                           20125
    transactions:                        20125  (335.18 per sec.)
    queries:                             20125  (335.18 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0413s
    total number of events:              20125

Latency (ms):
         min:                                    1.08
         avg:                                   23.86
         max:                                  274.73
         95th percentile:                       31.94
         sum:                               480107.97

Threads fairness:
    events (avg/stddev):           2515.6250/31.78
    execution time (avg/stddev):   60.0135/0.01